Repository: impworks/lens
Catalog: Lens/Translations/ParserMessages.*.resx
Languages: ru

# ArgTypeExpected
source: Argument type is expected!
ru: LE2001: Ожидается тип аргумента!

# ArgumentsExpected
source: Method call arguments are expected!
ru: LE2003: Ожидаются аргументы для вызова метода!

# ArrayItem
source: An array must contain at least one item!
ru: LE2004: Массив должен содержать по крайней мере один элемент!

# AssignExpressionExpected
source: Assignment expression is expected!
ru: LE2005: Ожидается присваиваемое выражение!

# CatchExpected
source: Catch clause is expected!
ru: LE2007: Ожидается блок catch!

# CodeBlockExpected
source: Code block is expected!
ru: LE2009: Ожидается блок кода!

# ConditionBlockExpected
source: Condition block is expected!
ru: LE2010: Ожидается блок условия!

# ConditionExpected
source: Condition is expected!
ru: LE2011: Ожидается условие!

# ConditionExpressionExpected
source: Condition expression is expected!
ru: LE2012: Ожидается выражение условия!

# DictionaryItem
source: A dictionary must contain at least one item!
ru: LE2013: Словарь должен содержать по крайней мере один элемент!

# DictionaryKeyExpected
source: Dictionary key expression is expected!
ru: LE2014: Ожидается ключ для записи словаря!

# DictionaryValueExpected
source: Dictionary value expression is expected!
ru: LE2015: Ожидается значение для записи словаря!

# ExceptionHandlerExpected
source: Exception handler code block is expected!
ru: LE2016: Ожидается блок-обработчик исключения!

# ExceptionTypeExpected
source: Exception type signature is expected!
ru: LE2017: Ожидается тип обрабатываемого исключения!

# ExpressionExpected
source: Expression is expected!
ru: LE2018: Ожидается выражение!

# FunctionBodyExpected
source: Function body is expected!
ru: LE2019: Ожидается тело функции!

# FunctionDefExpected
source: Function definition is expected!
ru: LE2020: Ожидается объявление функции!

# FunctionIdentifierExpected
source: Function name must be an identifier!
ru: LE2021: Имя функции должно быть идентификатором!

# FunctionReturnExpected
source: Function return type is expected!
ru: LE2022: Ожидается тип возвращаемого значения функции!

# IdentifierExpected
source: An identifier is expected!
ru: LE2023: Ожидается идентификатор!

# IndexExpressionExpected
source: Index expression is expected!
ru: LE2024: Ожидается выражение-индекс!

# InitExpressionExpected
source: Initializer expression is expected!
ru: LE2025: Ожидается инициализирующее выражение!

# InitExpressionOrTypeExpected
source: Initializer expression or type signature is expected!
ru: LE2026: Ожидается инициализирующее выражение или тип переменной!

# InitExpressionSeparatorExpected
source: Initializer expressions must be separated by a newline!
ru: LE2027: Инициализирующие выражения должны располагаться на отдельных строках!

# InvalidDouble
source: Value '{0}' is not a valid double!
ru: LE2029: Значение '{0}' не является допустимым дробным числом!

# InvalidInteger
source: Value '{0}' is not a valid integer!
ru: LE2030: Значение '{0}' не является допустимым целым числом!

# InvokePassSeparatorExpected
source: Invoke passes must be separated by a newline!
ru: LE2031: Выражения передачи значения должны располагаться на отдельных строках!

# ListItem
source: A list must contain at least one item!
ru: LE2032: Список должен содержать по крайней мере один элемент!

# LoopBodyExpected
source: Loop body block is expected!
ru: LE2033: Ожидается тело цикла!

# LoopExpressionExpected
source: Loop body expression is expected!
ru: LE2034: Ожидается выражение-тело цикла!

# MemberNameExpected
source: Member name is expected!
ru: LE2035: Ожидается имя поля!

# NamespaceExpected
source: A namespace is expected!
ru: LE2037: Ожидается пространство имен!

# NewlineSeparatorExpected
source: Statements must be separated by newlines!
ru: LE2038: Выражения должны располагаться на новых строках!

# RangeEndExpected
source: Range end expression is expected!
ru: LE2039: Ожидается выражение-конец диапазона!

# RecordFieldIdentifierExpected
source: Record field name must be an identifier!
ru: LE2040: Имя поля записи должно быть идентификатором!

# RecordFieldTypeExpected
source: Record field type signature is expected!
ru: LE2041: Ожидается тип поля записи!

# RecordIdentifierExpected
source: Record name must be an identifier!
ru: LE2042: Название записи должно быть идентификатором!

# RecordIndentExpected
source: Record body must be indented block!
ru: LE2043: Описание записи должно быть выделено отступами!

# RecordSeparatorExpected
source: Record fields must be separated by a newline!
ru: LE2044: Поля записи должны располагаться на отдельных строках!

# SequenceExpected
source: Sequence expression is expected!
ru: LE2046: Ожидается перечислимое выражение!

# SymbolExpected
source: '{0}' expected!
ru: LE2047: Ожидается '{0}'!

# TryBlockExpected
source: Try block is expected!
ru: LE2048: Ожидается блок try!

# TupleItem
source: A tuple must contain at least one item!
ru: LE2049: Кортеж должен содержать по крайней мере один элемент!

# TypeArgumentExpected
source: Type argument is expected!
ru: LE2050: Ожидается аргумент обобщенного типа!

# TypeIdentifierExpected
source: Type name must be an identifier!
ru: LE2051: Имя типа должно быть идентификатором!

# TypeIndentExpected
source: Type body must be indented block!
ru: LE2052: Описание типа должно быть выделено отступами!

# TypeLabelIdentifierExpected
source: Type label name must be an identifier!
ru: LE2053: Имя метки типа должно быть идентификатором!

# TypeLabelTagTypeExpected
source: Tag type signature is expected!
ru: LE2054: Ожидается тип связанного с меткой выражения!

# TypeSeparatorExpected
source: Type labels must be separated by a newline!
ru: LE2055: Метки должны располагаться на отдельных строках!

# TypeSignatureExpected
source: Type signature is expected!
ru: LE2056: Ожидается подпись типа!

# UnknownStatement
source: Unknown kind of statement!
ru: LE2057: Неизвестный тип выражения!

# VarIdentifierExpected
source: Variable name must be an identifier!
ru: LE2061: Имя переменной должно быть идентификатором!

# VarTypeExpected
source: Variable type is expected!
ru: LE2062: Ожидается подпись типа переменной!
